#include "Function_Init.H"
#include "MATH.H"

//霍尔水流传感器->外部中断计数，内部计时器定时

unsigned int number = 0;   //记录触发中断个数

void EX_Init(void);
uchar INT2_flag = 0x00;
/*****************************************************
*函数名称：void EXTI_Test(void)
*函数功能：外部中断测试
*入口参数：void
*出口参数：void
*****************************************************/
void EXTI_Test(void)
{
    EX_Init();
    while(1)
    {
    }
}
/*****************************************************
*函数名称：void EX_Init(void)
*函数功能：外部中断初始化
*入口参数：void
*出口参数：void
*****************************************************/
void EX_Init(void)
{
    //配置中断口INT03、INT24/25
//    P1CON &= 0XF7;     //中断IO口设置为高阻输入
//    P1PH  |= 0x08;     //中断IO口设置为高阻带上拉
    P2CON &= 0XFC;     //中断IO口设置为高阻输入
    P2PH  |= 0x03;     //中断IO口设置为高阻带上拉

    //配置INT03上升沿中断、INT24/25下降沿中断
    //下降沿设置
//    INT0F = 0X00 ;    //xxxx 0000  0关闭 1使能
    INT2F = 0X30 ;    //0000 xxxx  0关闭 1使能
    //上升沿设置
//    INT0R = 0X08 ;    //xxxx 0000  0关闭 1使能
    INT2R = 0X00 ;    //0000 xxxx  0关闭 1使能

    //外部中断优先级设置
    IE  |= 0x01;	//0000 0x0x
    IE1 |= 0x08;	//0000 x000  INT2使能
    IP  |= 0X00;
    IP1 |= 0X00;
    EA = 1;
}

/*****************************************************
*函数名称：void EX0/2() interrupt	0/10
*函数功能：外部中断服务函数
*入口参数：void
*出口参数：void
*****************************************************/

//void EX0() interrupt	0
//{
//    P02 = ~P02;
//}

void EX2() interrupt	10
{
    //中断2有两路输入，需要区分 ？？？
    number++; //霍尔水流传感器->外部中断计数

    //中断2有两路输入，需要区分 ？？？
    if(P20 == 0)
    {
        INT2_flag = 0x10; //INT12产生中断
    }
    if(P21 == 0)
    {
        INT2_flag = 0x20; //INT13产生中断
    }
}

//////////////////////////////////////////////////////////////
void Timer_Init(void);
/*****************************************************
*函数名称：void Timer_Test(void);
*函数功能：T0/T1/T2测试
*入口参数：void
*出口参数：void
*****************************************************/
void Timer_Test(void)
{
    Timer_Init();
    while(1)
    {
    }
}
/*****************************************************
*函数名称：void Timer_Init(void)
*函数功能：T0/T1/T2初始化
*入口参数：void
*出口参数：void
*****************************************************/
void Timer_Init(void)
{
    TMCON = 0X07;    //------111 ;Timer0、Tiemr1和Tiemr2选择时钟Fsys

    //T0设置
    TMOD |= 0x01;                 //0000 0001;Timer0设置工作方式1
    TL0 = (65536 - 24000)%256;    //溢出时间：时钟为Fsys，则24000*（1/Fsys）=1ms;
    TH0 = (65536 - 24000)/256;
    TR0 = 0;
    ET0 = 1;//定时器0允许
    TR0 = 1;//打开定时器0
//	//T1设置
//	TMOD |= 0x20;            //0010 0000;Timer1设置工作方式2
//	TL1 = 256 - 240;   //溢出时间：时钟为Fsys，则240*（1/Fsys）=10us;
//	TH1 = 256 - 240;
//	TR1 = 0;
//	ET1 = 1;//定时器1允许
//	TR1 = 1;//打开定时器1
//	//T2设置
//	T2MOD = 0x00;
//	T2CON = 0x00;	 //设置为16位重载寄存器
//	RCAP2H = (65536-48000)/256;     //溢出时间：时钟为Fsys，则48000*（1/Fsys）=2ms;
//	RCAP2L = (65536-48000)%256;
//	TR2 = 0;
//	ET2 = 1;//定时器2允许
//	TR2 = 1;//打开定时器2

    EA = 1;
}

/**************************************************
*函数名称：void timer0/1/2() interrupt 1/3/5
*函数功能：定时器中断产生方波
*入口参数：void
*出口参数：void
**************************************************/
void timer0() interrupt 1
{
//    TL0 = (65536 - 24000)%256;
//	TH0 = (65536 - 24000)/256;
//	P02 = ~P02;

    //定时到，关闭中断，统计霍尔水流传感器->外部中断计数，分析水流 ???
}

//void timer1() interrupt 3
//{
//	P03 = ~P03;
//}

//void Timer2Int(void) interrupt 5
//{
//	TF2 = 0;   //溢出清零
//    P04 = ~P04;
//}